{
  "applications": [
    {
      "position": "Intern, Full Stack Developer - Toronto",
      "company": "Avanade",
      "link": "https://www.google.com/search?q=avanade+internship&rlz=1C1CHBF_enCA780CA780&oq=Avanade+intern&aqs=chrome.0.0j69i57j0l4j69i60l2.5839j0j1&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwio2N-u9r7sAhUthHIEHWc0A0EQp4wCMAJ6BAgFEAE#fpstate=tldetail&htivrt=jobs&htiq=avanade+internship&htidocid=_FaDptp0QhxxgO3WAAAAAA%3D%3D&sxsrf=ALeKk03ZvJSt7ZABdXnDaNhCsrhpOskJqg:1603051007250",
      "description": "Job Description\n\nWelcome to the Avanade Canada digital studio, where the best in creative and technology mix it up to push the boundaries of innovation. We're a fast-moving, big-idea-dreaming, mishmash of software developers, technical architects, designers, UX architects, and more, who, when brought together, create trans formative digital experiences for some of the biggest and best brands on the planet. In the sound like a place you wouldn't mind hanging out this summer then read on?\n\nWe are looking for Full-stack Web Developers to learn and work with .NET and modern Angularamong other technologies.You will work with a team of experienced developers, designers and delivery managers as a junior team member.You will have the opportunity to code and see what the world of consulting is really like.",
      "applied": true,
      "id": 5
    },
    {
      "position": "Full Stack Developer (Winter 2020 Internship)",
      "company": "OpenCare",
      "link": "https://www.google.com/search?q=opencare+intern&rlz=1C1CHBF_enCA780CA780&oq=opencare+intern&aqs=chrome..69i57j69i60l3.1959j0j1&sourceid=chrome&ie=UTF-8&ibp=htl;jobs&sa=X&ved=2ahUKEwiW6vLYhb_sAhVQj3IEHZwgDo4Qp4wCMAB6BAgFEAE#fpstate=tldetail&htivrt=jobs&htiq=opencare+intern&htidocid=0FjnRVpPfba1ZyLPAAAAAA%3D%3D&sxsrf=ALeKk02vq7jkkmLPP0mOBTZcVkqqWSSELw:1603055122173",
      "description": "Before you read any further: Diversity is our thing at Opencare. We’ve worked hard to craft a team with a variety of backgrounds and perspectives. Why? We're glad you asked...experience means something different to each of us, and your unique combination of skills, passions, and experiences makes you a valuable asset to our team. We are all solving the same set of problems from our own unique lenses, and this is fundamental to our success as a business.\n\nOpencare’s Vision \n\nTo create technology that removes operational burden from dentists, so they can focus on patient care and experience \n\nOpencare is building technology to transform the dental industry. \n\nRunning a dental practice is becoming more and more complicated every year. At Opencare, we believe that dentists shouldn't have to worry about managing their practice, which frees them up to prioritize world class patient care experiences. After all, we live our most important life moments, from laughing and smiling to eating and talking, through our mouths.  \n\nYet for such an important body part, the thought of visiting the dentist instills fear and confusion in most people. We want to change that.  \n\nThrough the Opencare technology platform, we are enabling dentists to connect with new patients, streamline their day-to-day operations, and manage their billing seamlessly. All of this frees up time and energy that can be dedicated to helping patients understand and improve their oral wellness. \n\nWe believe that people reach their full potential at work when they are happy and healthy outside of work. You can learn more about our culture, as well as our professional and personal benefits here and you can also hear about it directly from our team here.\n\nOur Engineering Team’s Vision\nIn order to achieve our vision, we need an extraordinary Engineering team that is creative, passionate, and user-focused. We are a technology company that happens to be in healthcare, and we treat ourselves as such.\n\nOur Engineering team uses the most modern technology and processes available: we deploy to production multiple times per day with our continuous delivery pipeline, we have efficient code review processes on Github, and we are extremely agile with our product planning lifecycle. You will constantly be challenged to learn new technologies, and be given the freedom to solve problems on your own and learn by doing.\nAs a Full Stack Developer at Opencare, you'll spend your days:\nWorking with modern technology throughout our entire stack (Node.js, Angular, React, Postgres) running on AWS and deployed with Codeship\nSolving a wide variety of exciting design, product, and business problems (this includes implementing new product features and participating in the design process)\nWorking closely with our Design and Product teams to develop and deliver high-impact, high-quality, scalable web software, understand and prioritize projects, and solve product and design challenges in efficient and scalable ways\nCode reviewing JavaScript code across the team\nWhat skills will you bring to the team from day one?\nAn understanding of computer science fundamentals and can communicate decisions effectively to the wider Engineering and Product team \nA product mindset. You strive to put the needs of the user to the forefront whenever you work on a feature \nAn interest in working in agile development environments and working with product management tools (eg. Asana, Trello, Pivotal, or JIRA)\nYou’ll also have the opportunity to:\nDevelop software in Node.js, Angular, and React in a fast-paced, hyper-growth startup in the health and wellness space\nGrow your product management skills by always focusing on the end user first and foremost\nWhat we offer you\nOwnership: from day one, you will be deeply involved in defining the strategy and planning for your team. You will help shape the direction of Opencare!\nHealthy food and drinks: daily organic catered lunches, snack bar and fridge full of healthy snacks\nTeam events: we share a passion for our work and also know how to have fun (team retreats, monthly events, weekly socials etc.)\nGreat downtown location: we have a spacious, open-concept office right at Dundas and University\n\nQuick facts\n- Culture is our number one priority -- which is why we have such an amazing team!\n- We are delivering over $165 million in patient value each year (and growing!)\n- Patients love Opencare, giving us a net promoter score higher than their iPhone and Netflix\n- Funded by top-tier US venture firms and angels (8VC, ff VC, Real Ventures, Collaborative Fund, and more)",
      "applied": false,
      "id": 7
    },
    {
      "position": "Intern- Front-End Software Developer Winter 2021",
      "company": "Coveo",
      "link": "https://www.coveo.com/en/company/careers/open-positions/internships/intern-front-end-software-developer-winter-2021/4920029002?gh_jid=4920029002&gh_src=%7B%22www.coveo.com%22%3A%22https%3A%2F%2Fwww.coveo.com%2Fen%2Fcompany%2Fcareers%2Fopen-positions%22%7D",
      "description": "Your mission (if you accept it): Develop the heart of Coveo\nWhat do we mean by developing the heart of Coveo? We mean helping us in the development of all the admin and/or user interfaces we offer our clients. These interfaces are the visual part of all the micro-services supporting and powering the ENTIRETY of our lines of business. You will thus have a key role in allowing our clients to configure their intelligent and personalized recommendations platform, exactly the way they see fit. \n\nWe also have a lot of open source projects in active development, most of them used by multiple teams at Coveo, and external teams as well.\n\nLet’s recap. Are we talking about working on a product being #1 in its industry combined with the opportunity to make your mark in the open source community? Yes, we are.\n\nIt's very simple, we want you to:\nBe passionate about technology\nBe curious and love learning\nBe willing to take initiatives\nBe proud of what you create\nBe interested in the Front-End development\nHave knowledge of JavaScript and TypeScript\nIn a typical day, you will:\nWrite tons of code\nMake sure you test your code like a pro to avoid salty surprises in production\nBe actively involved in decisions regarding upcoming features and ways of implementing them\nKeep in close contact with the UX team to develop awesome-looking features that simply make sense for users.\nBe surrounded by bright, curious and respectful people, eager to grow their teammates and colleagues\nHave fun, guaranteed.\n \n\nWhy Intern at Coveo?\nInterning at Coveo is an opportunity to be part of a passionate and talented team working with bleeding edge technology. This is not our first rodeo! We have welcomed and accompanied interns since 2008! You will be entrusted with the development of projects worthy of your aspirations and ambitions and you will be supervised by a coach who will share with you a wealth of knowledge that can only be taught in a workplace. Even if we are working from home, we still have many ways to connect; hackathons, lunch and learn, 5 @ 7 to only name a few !",
      "applied": false,
      "id": 8
    }
  ]
}